import time
import winsound
import threading
print("желательно пройти квест два или три раза так как в нём несколько концовок")
input()
print("однажды вечером")
input()
a = 1
q = 1 
s = 1 
d = 1
b = 1
v = 1
l = 1
w = 1
f = 1
x = 1
c = 1
k = 1
u = 1
y = 1
z = 1
print("блин ну и сколько его ждать!")
input()
def play_music():
        winsound.PlaySound("lopol.wav", winsound.SND_FILENAME)

music_thread = threading.Thread(target=play_music)
music_thread.start()
print('''
          ¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
     `````¶¶`¶¶¶¶¶````````````````````````````````¶¶¶¶¶¶¶
     `````¶¶`````¶¶¶¶`````````````````````````¶¶¶¶¶````¶¶
     `````¶¶```````¶¶¶¶¶```````````````````¶¶¶¶¶```````¶¶
     `````¶¶```````````¶¶¶¶¶````````````¶¶¶¶```````````¶¶
     `````¶¶````````````¶¶¶¶¶¶```````¶¶¶¶¶¶¶```````````¶¶
     `````¶¶``````````¶¶¶````¶¶¶¶¶¶¶¶¶````¶¶¶¶`````````¶¶
     `````¶¶`````````¶¶¶````````¶¶¶````````¶¶¶¶````````¶¶
     `````¶¶``````¶¶¶¶````````````````````````¶¶```````¶¶
     `````¶¶`````¶¶¶¶``````````````````````````¶¶¶`````¶¶
     `````¶¶````¶¶``````````````````````````````¶¶¶¶```¶¶
     `````¶¶`¶¶¶¶``````У ВАС НОВОЕ СООБЩЕНИЕ```````¶¶¶`¶¶
     `````¶¶¶¶¶¶````````````````````````````````````¶¶¶¶¶
     `````¶¶¶¶````````````````````````````````````````¶¶¶
     `````¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
''')
input("доча ты закрыла входную дверь?")
input("не помню")
input("а что?")
input("значит так слушай меня внимательно")
input("пап не пугай!")
input("посмотри в окно,видишь мужчину в чёрном?")
input("что,зачем?")
input("посмотри скорее!")
input("не вкоем случае не спускай глаз")
input("хорошо а почему?")
input("это сложно понять")
input("позвони мне")
input("не могу я в маршрутке")
input("почему ты мне не сказал что поехал в центр")
input("какой центр")
input("ну а откуда ты ехал на маршрутке")
input("только если от мамы")
input("я хотел обсудить развод")
input("но она не захотела меня слушать")
input("чёрт пап я отвернула взгляд и он исчез")
input("прячься!!")
print("1.спрятаться на кухне")
print("2.спрятаться в чулане")
a=int(input())
if a=="1":
    print("амм... пап почему я его не слышу")
    input()
    print("пап дверь открывается!!")
    input()
    print("сюрприз!!")
    input()
    print("ты издеваешься!!")
    input()
    print("у меня чуть причтуп не случился!!")
elif a=="2":
    print("надо затаить дыхание")
    input()
def play_music():
    winsound.PlaySound("lopol.wav", winsound.SND_FILENAME)

music_thread = threading.Thread(target=play_music)
music_thread.start()
print('''
          ¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
     `````¶¶`¶¶¶¶¶````````````````````````````````¶¶¶¶¶¶¶
     `````¶¶`````¶¶¶¶`````````````````````````¶¶¶¶¶````¶¶
     `````¶¶```````¶¶¶¶¶```````````````````¶¶¶¶¶```````¶¶
     `````¶¶```````````¶¶¶¶¶````````````¶¶¶¶```````````¶¶
     `````¶¶````````````¶¶¶¶¶¶```````¶¶¶¶¶¶¶```````````¶¶
     `````¶¶``````````¶¶¶````¶¶¶¶¶¶¶¶¶````¶¶¶¶`````````¶¶
     `````¶¶`````````¶¶¶````````¶¶¶````````¶¶¶¶````````¶¶
     `````¶¶``````¶¶¶¶````````````````````````¶¶```````¶¶
     `````¶¶`````¶¶¶¶``````````````````````````¶¶¶`````¶¶
     `````¶¶````¶¶``````````````````````````````¶¶¶¶```¶¶
     `````¶¶`¶¶¶¶``````У ВАС НОВОЕ СООБЩЕНИЕ```````¶¶¶`¶¶
     `````¶¶¶¶¶¶````````````````````````````````````¶¶¶¶¶
     `````¶¶¶¶````````````````````````````````````````¶¶¶
     `````¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
''')
input()
input("блин этот телефон меня выдаст")
input("привет")
print("я застыла и секунд пять я просто сидела в тишине")
print("просьба не куда не нажимать пока не высветится новое сообщение")
time.sleep(5)
input("пока не получила новое сообщение")
input("почему молчишь?")
print("1.выключить телефон")
print("2.ответить кто ты?")
b=input()
if b == "1":
    print("какая ты наивная девочка(раздался голос из зади)")
    input()
    print("1.начать бежать")
    print("2.обернуться")
    c = input()
if c=="1":
    print("я как буд-то бы застыла")
    input()
    print("прекрастная история")
    input()
    print("это была последняя участница сегоднешнего шоу")
    input()
    print("итак победителем сегоднешнего конкурса становится инна филп, поздравляем(это ваша героиня)")
elif c=="2":    
    print("привет доча")
    input()
    print("и резкий удар в спину")
    input()
    print("больше ни чего не помню")
    input()
    print("амм...")
    input()
    print("твой отец умер пол года назад")
    input()
    print("Лина у тебя большие повреждения в области мозга")
    input()
    print("нам придётся перевести тебя в псих больницу")
    input()
    print("1.согласится")
    print("2.бежать от туда")
elif b=="2":
    print("я твой главный страх")
    input()
    print("лина пошли спать нам завтра опять в поход")
    input()
    print("ладно")
s=input()
if s=="1":
    print("вы остались там до конца своих дней")
    pass
elif s=="2":
    print("вы в коридоре")
def room1(): 
    global v,l
    v=input()
    if v ==1: 
        print("вы в коридоре") 
        v = 2
        print("1.побежать в приёмочную")
        print("2.побежать в ренгенную")
    else: 
        print("Лина не веди себя как ребёнок,ты действительно думаешь что убежишь от сюда") 
        print("иди сюда")
        print("1.подойти к ней ") 
        print("2.убежать от неё в ренгенную  ") 
        l=input() 
    if  l=="1": 
        print("в больнице не так плохо") 
        input()
        print("я провела там остаток своих дней")
        pass
    elif l == "2": 
        room3() 
 

def room2(): 
    global x,d
    x=input()
    if x==1: 
        print("вы видите пациэнтов и врача ") 
        x=2 
        print("1.выбежать и побежать в коридор")
        print("2.побежать в ренгенную")
    else: 
        print("здравствуйте,меня беспокоит температура") 
        input()
        print("что?")
        input()
        print("я знаю кто вы, сейчас я отведу вас обратно в палату и вас переведут в больницу для психически больных")
        input()
        print("вы пробыли там до конца дней((")
        pass
   

def room3(): 
    global f,u 
    f=input()
    if f==1:
        print("перед вами доктор и ренгенный аппарат") 
        f=2
        print("1.убежать от туда в приёмочную") 
        print("2.побежать в коридор") 
    else: 
        print("здравствуйте") 
        print("здравствуй а почему вы вошли и вышли")
        print("долго объяснять")
        print("1.сказать что якобы болит рука ") 
        print("2.попробывать выйти из окна пока доктр в не даумении") 
        u=input()
        if u=="1": 
            print("хорошо проходите к ренгенному столу")
            print("у вас всё хорошо")
            print("доктор я не знаю эту больницу не могли бы вы меня провести до выхода")
            print("да конечно")
            print("я проснулась в холодном поту,сны хуже мне не снились!")
            pass
        elif u=="2": 
            print("это был 5 этаж,вы разбились") 
        pass
        

room1()
